Revit 2017 API
ExternalResourceReference.Version Property
 The version of the external data that was most recently loaded in Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2015
Syntax
C#
public string Version { get; }
Visual Basic
Public ReadOnly Property Version As String
	Get
Visual C++
public:
property String^ Version {
	String^ get ();
}
See Also
ExternalResourceReference Class
Autodesk.Revit.DB Namespace